dbconfig/app/controllers/platos_controller.rb

  def index
    @platos = Plato.all
---
SELECT "platos".* FROM "platos"

  def show
    @plato = Plato.find(params[:id])
---
SELECT  "platos".* FROM "platos"  WHERE "platos"."id" = ? LIMIT 1  [["id", 0]]

  def create
    if params[:get]
      @plato = Plato.where("soda_id = ?", params[:soda_id])

      #if !@plato.comentario.first.nil?
       # render json: @plato.as_json(only: [:id, :nombre, :precio, :categoria, :tipo, :calificaciones, :total, :soda_id], include: [comentario:{only: [:id]}])
      #else
        render json: @plato.as_json(only: [:id, :nombre, :precio, :categoria, :tipo, :calificaciones, :total, :soda_id])
      #end

    else
      @plato = Plato.new(plato_params)

      if @plato.save
---
SELECT  "platos".* FROM "platos"  WHERE "platos"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "platos" ("calificaciones", "categoria", "created_at", "nombre", "precio", "soda_id", "tipo", "total", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)