dbconfig/app/controllers/sodas_controller.rb

  def index
    @sodas = Soda.all
---
SELECT "sodas".* FROM "sodas"