dbconfig/app/controllers/usuarios_controller.rb

  def index
    @usuarios = Usuario.all
---
SELECT "usuarios".* FROM "usuarios"

  def show
    @usuario = Usuario.find(params[:id])

    if !@usuario.comentario.first.nil?
---
SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comentarios".* FROM "comentarios"  WHERE "comentarios"."usuario_id" = ?  ORDER BY "comentarios"."id" ASC LIMIT 1  [["usuario_id", 1]]

  def create
    @usuario = Usuario.new(usuario_params)

    if @usuario.save
---
INSERT INTO "usuarios" ("created_at", "direccion", "nombre", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-04 02:08:57.058687"], ["direccion", "a@a.com"], ["nombre", "Jorge"], ["updated_at", "2014-10-04 02:08:57.058687"]]